app/views/students/show.html.haml

SELECT "courses".* FROM "courses" INNER JOIN "courses_students" ON "courses"."id" = "courses_students"."course_id" WHERE "courses_students"."student_id" = ?  [["student_id", 2]]
---
    %tbody
    -@student.courses.each do |c|