app/views/requirements/show.html.haml

      %tbody
      -@requirement.courses.each do |c|
---
SELECT "courses".* FROM "courses" INNER JOIN "courses_requirements" ON "courses"."id" = "courses_requirements"."course_id" WHERE "courses_requirements"."requirement_id" = ?  [["requirement_id", 3]]