app/views/courses/show.html.haml

SELECT  "students".* FROM "students" INNER JOIN "courses_students" ON "students"."id" = "courses_students"."student_id" WHERE "courses_students"."course_id" = ?  ORDER BY "students"."id" DESC LIMIT 1  [[nil, 1]]
---
    %tbody
    -@course.students.each do |s|