app/controllers/courses_controller.rb

  def index
        if params[:sort] != nil
            query = params[:sort]
        else
            query = "crn"
        end


        if params[:commit] == "Filter courses"
				filterStr = buildFilterString()
				@courses = filterStr ? Course.filter(filterStr) : Course.sorted_by(query)
		  else
			   @courses = Course.sorted_by(query)

		  end






=begin       if params[:courses_search] != nil
            searchfield = params[:courses_search]
            @courses = searchfield ? Course.search(searchfield) : Course.sorted_by(query)
---
SELECT "courses".* FROM "courses" WHERE (dept like % AND instructor like % AND level like % AND day like % AND after >= % AND before <= %)

  def show
	@course = Course.find(params[:id])
<<<<<<< HEAD
        Courses.all.each do |s|
---
SELECT "courses".* FROM "courses"

  def create
        c = Course.new(safe_params)
        if c.save
---
INSERT INTO "courses" ("dept", "level", "crn", "course_name", "title", "instructor", "days", "starts", "ends", "building_room", "credits", "coreq", "crosslist", "restrictions", "prereq", "notes", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
        @course = Course.find params[:id]
        @course.update(safe_params)
---
UPDATE "courses" SET "course_name" = ?, "title" = ?, "instructor" = ?, "building_room" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["course_name", "Afds"], ["title", "Xdsf"], ["instructor", "Zfs"], ["building_room", "Ffdsafd"], ["updated_at", "2015-04-12 22:02:26.974194"], ["id", 2]]