app/controllers/courses_controller.rb

  def index
        if params[:sort] != nil
            query = params[:sort]
        else
            query = "crn"
        end


        if params[:commit] == "Filter courses"
				filterStr = buildFilterString()
				@courses = filterStr ? Course.filter(filterStr) : Course.sorted_by(query)
		  else
			   @courses = Course.sorted_by(query)

		  end






=begin       if params[:courses_search] != nil
            searchfield = params[:courses_search]
            @courses = searchfield ? Course.search(searchfield) : Course.sorted_by(query)
---
SELECT "courses".* FROM "courses" WHERE (dept like 'COSC' AND instructor like 'Stratton' AND (level - '300') < 100 AND (level - '300') > 0 AND days like 'TR' AND starts >= '900' AND starts <= '1500' )

  def show
	@course = Course.find(params[:id])
<<<<<<< HEAD
        Courses.all.each do |s|
=======
        Student.all.each do |s|
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "students".* FROM "students" WHERE "students"."course_id" = ?  ORDER BY "students"."id" DESC LIMIT 1  [["course_id", 1]]

  def create
        c = Course.new(safe_params)
        if c.save
---
INSERT INTO "courses" ("dept", "crn", "course_name", "title", "instructor", "days", "starts", "ends", "building_room", "credits", "coreq", "crosslist", "restrictions", "prereq", "notes", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def edit
        @course = Course.find params[:id]
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 1]]

  def update
        @course = Course.find params[:id]
        @course.update(safe_params)
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "courses" SET "title" = ?, "instructor" = ?, "coreq" = ?, "crosslist" = ?, "restrictions" = ?, "prereq" = ?, "notes" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["title", "Networks"], ["instructor", "Vijay"], ["coreq", ""], ["crosslist", ""], ["restrictions", ""], ["prereq", ""], ["notes", ""], ["updated_at", "2015-04-03 20:40:23.077413"], ["id", 1]]