app/controllers/requirements_controller.rb

SELECT "requirements".* FROM "requirements" WHERE (name LIKE '%%')  ORDER BY name
---
  def index
    searchfield = params[:requirements_search]
    @requirements = searchfield ? Requirement.search(searchfield) : Requirement.sorted_by("name")

SELECT  "requirements".* FROM "requirements" WHERE "requirements"."id" = ? LIMIT 1  [["id", 1]]
SELECT "courses".* FROM "courses"
---
  def show
    @requirement = Requirement.find(params[:id])
    Course.all.each do |c|

INSERT INTO "requirements" ("name", "course", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Religion"], ["course", 10545], ["created_at", "2015-04-03 01:47:14.616706"], ["updated_at", "2015-04-03 01:47:14.616706"]]
---
  def create
    @requirement = Requirement.new(create_update_params)
    if @requirement.save

SELECT  "requirements".* FROM "requirements" WHERE "requirements"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @requirement = Requirement.find(params[:id])

SELECT  "requirements".* FROM "requirements" WHERE "requirements"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "requirements" SET "course" = ?, "updated_at" = ? WHERE "requirements"."id" = ?  [["course", 10286], ["updated_at", "2015-04-03 02:12:10.184697"], ["id", 1]]
---
  def update
    @requirement = Requirement.find(params[:id])
    @requirement.update(create_update_params)

SELECT  "requirements".* FROM "requirements" WHERE "requirements"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "requirements" WHERE "requirements"."id" = ?  [["id", 2]]
---
  def destroy
    @requirement = Requirement.find(params[:id])
    @requirement.destroy