app/controllers/students_controller.rb

SELECT "students".* FROM "students"  ORDER BY LOWER(first)
---
       def index
		if params[:sort]
			query = params[:sort]
		else
			query = 'last'
		end
                if params[:students_search] != nil
                        searchfield = params[:students_search]
                        @students = searchfield ? Student.search(searchfield) : Student.sorted_by(query)

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
SELECT "courses".* FROM "courses"
---
	def show
		@student = Student.find(params[:id])
                Course.all.each do |c|

INSERT INTO "students" ("first", "last", "sid", "major") VALUES (?, ?, ?, ?)  [["first", "James"], ["last", "Harden"], ["sid", "888888888"], ["major", "COSC"]]
---
	def create
		s = Student.new(safe_params)
		if s.save

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
---
	def edit
		@student = Student.find params[:id]

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "last" = ?, "sid" = ?, "year" = ?, "major" = ? WHERE "students"."id" = ?  [["last", "dean"], ["sid", "987654321"], ["year", 2018], ["major", ""], ["id", 1]]
---
	def update
		@student = Student.find params[:id]
		@student.update(safe_params)

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "students" WHERE "students"."id" = ?  [["id", 2]]
---
	def destroy
		@student = Student.find(params[:id])
		@student.destroy