app/controllers/students_controller.rb

SELECT "students".* FROM "students" WHERE (name like '%Courtney%')
---
       def index
		if params[:sort]
			query = params[:sort]
		else
			query = 'last'
		end
                if params[:students_search] != nil
                        searchfield = params[:students_search]
                        @students = searchfield ? Student.search(searchfield) : Student.sorted_by(query)

INSERT INTO "students" ("first", "last", "sid", "year", "major") VALUES (?, ?, ?, ?, ?)  [["first", "Gracie"], ["last", "Rentschler"], ["sid", "0008304322"], ["year", 2016], ["major", "Chinese"]]
---
	def create
		s = Student.new(safe_params)
		if s.save

UPDATE "students" SET "sid" = ?, "year" = ?, "major" = ? WHERE "students"."id" = ?  [["sid", "1"], ["year", 2016], ["major", "Comp Sci"], ["id", 1]]
---
	def update
		@student = Student.find params[:id]
		@student.update(safe_params)